In [1]:
import numpy as np

In [ ]:
my_list = [1,2,3,4]
my_list

In [ ]:
np.array([my_list])

In [ ]:
my_matrix = [[1,2,3],[4,5,6], [7,8,9]]
np.array([my_matrix])

In [ ]:
np.arange(0,10)

In [ ]:
np.arange(0,30,2)

In [ ]:
np.zeros(4)

In [ ]:
np.zeros((5,5)) #basically here is a matrix shorcut

In [ ]:
np.linspace(0,10,3)# generates random numbers

In [ ]:
np.linspace(0,10,50) # parameters (start, end, number of values)

In [ ]:
np.random.rand(2)# creates 2 random numbers in an array

In [ ]:
np.random.rand(5,5)# in a matrix

In [ ]:
#pandas powefull version of Excel

In [ ]:
#series datatype -- what differentiae seires from numpy is that you can add labels or can index labels

In [2]:
import pandas as pd

In [3]:
labels = ['a','b','c']

In [4]:
my_list = [10,20,30]
arr = np.array([10,20,30])
d={'a' : 10, 'b' : 20, 'c': 30}

In [5]:
pd.Series(data =my_list) # basicallt adds a key to this which turns it to a object

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data = my_list, index = labels) # combines it

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr) # key to using  the series is understanding the index

0    10
1    20
2    30
dtype: int32

In [8]:
#How to grab an information in a series

In [9]:
ser1 = pd.Series([1,2,3,4] , index = ['USA', 'Germany', 'USSR', 'Japan']) #combines two information still (add Key)

In [10]:
ser2 = pd.Series([1,2,5,4], index = ['USA', 'Germany', 'Italy','Japan']) #we perform operations based on index return NAN because it is not Included
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [11]:
# the more important ones -- Data frames - the workforce of Pandas (bunch of series of obj that shares a series of index)

In [12]:
from numpy.random import randn
np.random.seed(101) # seed is a method where it tries to designate an allowable amount of samples

In [20]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(),columns ='W X Y Z'.split()) # this is shit

In [21]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [22]:
#missing data's in Pandas

In [24]:
df1 = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],"C":[1,2,3]})

In [25]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [26]:
# How to drop rows with NaN's

In [28]:
df1.dropna(axis=1) #drops na if we use dropna only it will drop rows and leave those that has complete rows

   C
0  1
1  2
2  3

In [30]:
df1.fillna(value = 'Valid') # added Valid string to NA's

       A      B  C
0    1.0    5.0  1
1    2.0  Valid  2
2  Valid  Valid  3

In [32]:
pwd

'C:\\Users\\MTCL7-02\\Documents\\Untitled Folder'

In [33]:
# Data input and output

In [35]:
df2 = pd.read_csv('example')

In [36]:
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [38]:
df2.to_csv('example', index =False)

In [39]:
# open an excel file instead of CSV file -- only imports data tho

In [41]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [ ]:
# -- end of the fundamentals